//=============================================================================
//
//  title.h
// Author : Shota Fukuoka
//
//=============================================================================
#ifndef _TITLE_SCENE_H_
#define _TITLE_SCENE_H_

//*****************************************************************************
// ヘッダファイル
//*****************************************************************************
#include "scene.h"

class NextScene;
//*****************************************************************************
// クラス定義
//*****************************************************************************
class Title : public Scene
{
public:
	Title(){};
	virtual ~Title() {};
	HRESULT Init(NextScene* pScene);
	void Release(void);
	void Update(void);
	void Draw(void);
private:
	NextScene*						m_pNextScene;
};

#endif
