//=============================================================================
//
// player.h
// Author : SHOTA FUKUOKA
//
//=============================================================================
#ifndef _CAMERA_PATTERN_COMPLIANCE_H_
#define _CAMERA_PATTERN_COMPLIANCE_H_

//*****************************************************************************
// インクルード
//*****************************************************************************
#include "camera_pattern.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
class MainCamera;
//*****************************************************************************
// クラス定義
//*****************************************************************************
class CameraPatternCompliance : public CameraPattern
{
	bool m_bUse;
public:
	CameraPatternCompliance();

	virtual ~CameraPatternCompliance() {}
	virtual void Update(MainCamera* pMainCamera) override;
};

#endif