//=============================================================================
//
// player.h
// Author : SHOTA FUKUOKA
//
//=============================================================================
#ifndef _CAMERA_PATTERN_H_
#define _CAMERA_PATTERN_H_

//*****************************************************************************
// インクルード
//*****************************************************************************

//*****************************************************************************
// マクロ定義
//*****************************************************************************
class MainCamera;
//*****************************************************************************
// クラス定義
//*****************************************************************************
class CameraPattern
{
public:
	virtual ~CameraPattern() {}
	virtual void Update(MainCamera* pMainCamera) = 0;
};

class CameraPatternNone : public CameraPattern
{
public:
	virtual ~CameraPatternNone() {}
	virtual void Update(MainCamera* pMainCamera) override {}
};

#endif