//=============================================================================
//
// operation.h
// Author : shota fukuoka
//
//=============================================================================
#ifndef _OPERATION_H_
#define _OPERATION_H_

//*****************************************************************************
// ヘッダファイル
//*****************************************************************************
#include <Windows.h>
#include "../../canvas/canvas.h"
#include "../../../renderer/app_renderer.h"

//*****************************************************************************
// ライブラリファイル
// [構成プロパティ]->[リンカー]->[入力]->[追加の依存ファイル]に記述しても可能
//*****************************************************************************

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class Operation : public Canvas
{
public:
	//コンストラクタ
	Operation(RenderManager* pRenderManager,
		ShaderManager* pShaderManager,
		TextureManager* pTextureManager);

	//デストラクタ
	virtual ~Operation( );

	//終了
	void Release( void );

	//更新
	void Update( void );

	//バッファ
	void MakeVertex(ID3D11Device* pDevice);

private:

	VECTOR3							m_size;

	RenderManager*				m_pRenderManager;

	Renderer*						m_pRenderer;

	bool							m_bUse;
};

#endif